Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.TypePanelsFronNonRectCellsUnlocked
Loaded family curtain panels cannot be used in non-rectangular cells of the curtain host. Type-driven panels from non-rectangular cells were unlocked and left unchanged.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.RuledCurtainElementLostCurves
Ruled Curtain System cannot be built. The Lines or Edges used to create it cannot be found.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.RequestOrphanMullionDeletion
Due to the changes in parameters of their hosts some mullions became non-type driven.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.NonSupportedCurtainWall
Currently, only straight Walls with straight or arc edges are supported for non-rectangular Curtain Walls.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.NoPanelsLoaded
No Curtain Panel Families loaded. Can't make arced Curtain Wall.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.NegativeBeltDistance
Measurement Line Offset cannot be negative.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.MustReplacePanels
Missing Curtain Panels will be replaced with System Panels to complete command.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.MultipleIdsInCurtainSystem
A Curtain System cannot be based on faces from multiple elements.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.MultipleDominatingMullions
Multiple dominating mullions on a grid face may cause ambiguous automatic adjustment of margins.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.MullionsWillBeDeleted
The Mullions between the Panels being joined will be deleted.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.MullionLostRefReorder
Mullions have lost references as a result of gridlines changing order.  These mullions must be deleted.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.InvalidSkipSegments
A curtain grid line had invalid removed segment data.  When correcting data, Revit may have split curtain panels that should be combined.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesWerePushed
Panels and mullions created by a curtain grid were created with slight inaccuracies.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOverlap
Overlapping gridlines should be avoided, unless there are only two and one is host type dependent and the other is not.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOutsideWillBeRedependent
Type associated curtain grid lines outside of the edited wall boundaries will be made dependent again in order that they remain on the wall.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOutOfBoundsWarn
Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOutOfBounds
Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridOutsideWall
Curtain wall grid lines are outside wall.  If you are trying to shorten the wall, please remove grid lines, including mullions on top of them.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridOutOfOrderError
Curtain wall grid lines have changed order.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridOutOfOrder
Curtain wall grid lines have changed order.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.ExessiveBeltDistance
The requested Measurement Line Offset would place the put the Measurement Line of the face boundaries.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.ExceedMaxDrivenGridlines
Changes have been made that cause a curtain wall with type driven grid lines to exceed the maximum allowed number of type driven lines (200 in direction (1) and 200 in direction (2)).  If you really need this many type driven grid lines, please split the affected wall before proceeding.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.DependentGridlineMayBeDeleted
Type generated gridlines will become non-associated due to changes in the type.  Press delete if you wish to remove them instead.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.DeletingCurtainSystemFaceGridLines
Deleting Grid Lines residing on faces that no longer are part of a Curtain System.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.DanglingCurtainWallCorner
A Corner Mullion has been placed at the end of a Curtain Wall that is not joined to another Curtain Wall. The angle of the Corner Mullion will default to 90 degrees.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CurtainSystemHostInvisible
Element defining the Curtain System is invisible in the current view.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CurtainGridOffHost
Curtain grid has left its host.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CurtainGridFaceCannotBeReparamForGridRotation
Curtain grids cannot be rotated exactly as requested. Push "Adjust Grids" to get the nearest valid rotation.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotUseCornerMullion
Corner Mullions must be placed at a location that can have neighboring Panels that are not tangent. With the exception of Wall Join locations, Corner Mullions are not currently supported on the external boundaries of Curtain elements.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotSwitchToCurtainWall
Can't switch type to Curtain Wall after Edit Elevation Profile.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotSplitOldMullions
Split does not work on curtain walls containing mullions created in Revit prior to version 4.0.  You may delete the mullions, place them again, and then proceed with splitting the wall.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotPlaceSplitMullions
Could not determine how to place the highlighted mullions after the wall was split.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotHaveIndependentOverlappingGrids
Overlapping independent type associated gridlines are not allowed.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotGroupCurtainGridHost
Curtain grid based elements cannot be grouped.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotDivideCurtainGrid
Can't divide Curtain Grid by Grid Line.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotApplyGridSpecification
It is not possible to apply the host family's grid specification to this instance.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.AllGridSegmentsRemoved
Curtain grid lines must have at least one segment.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.AdjustEndCurtainWallParameterNoCorners
Can't put Corner Mullion at end joined to non-Curtain Wall.

Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures
Failures about CurtainWall.